package ru.job4j.tdd;

/**
 * Что такое TDD.
 * Важный подход в создании программы - это начать описывать поведение системы через тесты.
 * В таком подходе мы фокусируемся на возможности системы, а не на ее реализацию.
 * Любую систему можно описать через интерфейсы взаимодействия.
 * Такой поход называется программирование через тесты - Test Driven Development.
 *
 *
 * Задание:
 * Реализация сервиса кинотеатр через TDD.
 * Рассмотрим требования клиента о создании сайта кинотеатра.
 * На сайте можно найти сеансы, и купить билеты.
 * Опишем нужные элементы системы.
 *
 * Всю систему мы описываем через 4 интерфейса .
 * Опишем поведение пользователя через тесты (class CinemaTest).
 *
 * 2. Интерфейс пользователь
 */
public interface Account {
}
